<a href="https://colab.research.google.com/github/CodeWithSridhar/Innomatics-Internship/blob/main/Task7_Descriptive_Statistics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Assignment**
# Task 7 - Descriptive Statistics

## Descriptive Statistics and Python ImplementationðŸ˜§

Dataset: https://drive.google.com/file/d/1l040PTRmQ9fw5VULbwG-qM6P2A5xZIBQ/view

Write a Jupyter Notebook explaining all the Descriptive Statistics.
 
    Mean
    Median
    Mode
    Variance
    Standard Deviation
    Correlation
    Normal Distribution (use references)
    Feature of Normal Distribution
    Positively Skewed & Negatively Skewed Normal Distribution
    Effect on Mean, Median and Mode due to Skewness
    Explain QQ Plot and show the implementation of the same
    Explain Box Cox and show the implementation of the same


Explain each topic (mentioned above) with the help of images, code examples (with and without library functions) and formulas (written using LaTeX

In [ ]:
# importing libraries

import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from scipy import stats

In [ ]:
# importing dataset

data = pd.read_csv("https://raw.githubusercontent.com/CodeWithSridhar/Innomatics-Internship/main/data.csv")

In [ ]:
data.head()

   Mthly_HH_Income  ...  No_of_Earning_Members
0             5000  ...                      1
1             6000  ...                      1
2            10000  ...                      1
3            10000  ...                      1
4            12500  ...                      1

[5 rows x 7 columns]

In [ ]:
data.tail()

    Mthly_HH_Income  ...  No_of_Earning_Members
45            90000  ...                      3
46            98000  ...                      2
47           100000  ...                      3
48           100000  ...                      2
49           100000  ...                      1

[5 rows x 7 columns]

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 7 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Mthly_HH_Income           50 non-null     int64
 1   Mthly_HH_Expense          50 non-null     int64
 2   No_of_Fly_Members         50 non-null     int64
 3   Emi_or_Rent_Amt           50 non-null     int64
 4   Annual_HH_Income          50 non-null     int64
 5   Highest_Qualified_Member  50 non-null     object
 6   No_of_Earning_Members     50 non-null     int64
dtypes: int64(6), object(1)
memory usage: 2.9+ KB

In [ ]:
data.describe()

       Mthly_HH_Income  ...  No_of_Earning_Members
count        50.000000  ...              50.000000
mean      41558.000000  ...               1.460000
std       26097.908979  ...               0.734291
min        5000.000000  ...               1.000000
25%       23550.000000  ...               1.000000
50%       35000.000000  ...               1.000000
75%       50375.000000  ...               2.000000
max      100000.000000  ...               4.000000

[8 rows x 6 columns]

In [ ]:
data.shape

(50, 7)